25931 play 1
35158 time 1
11703 every 1
15420 hard 1
13315 forget 1
35956 try 2
34972 though 1
32265 song 2
25000 passage 1
24894 paraphrase 1
26342 possibly 1
27504 quite 1
31507 singing 1
16843 if 1
16599 humming 1
31946 smiling 1
2239 audiences 1
19705 leave 1
33915 sure 1
25700 piece 1
11253 enjoyable 1
17622 inoffensive 1
15549 hate 1
17099 impossible 1
308 about 1
18721 just 2
37178 value 1
11333 entertainment 1
8884 denying 1
38021 way 1
14500 goes 1
23333 niceness 1
20204 little 1
3107 being 1
8284 danger 1
35072 thus 1
20934 manager 1
36039 turn 1
10683 edgy 1
28511 remotely 1
35030 throughout 1
10676 edge 1
22707 much 1
34245 t 1
18166 isn 1
23598 note 1
14555 good 1
12505 feel 1
1692 appropriately 1
1315 an 3
11171 ending 1
34102 sweetness 1
28985 reverts 1
27470 quickly 1
35342 tone 1
34852 then 1
11684 even 1
35496 toward 1
11791 except 1
2121 at 1
21200 marvelling 1
24546 overnight 1
14435 glow 1
2824 basking 1
15405 happy 1
11707 everyone 1
17833 interesting 1
7085 consistently 1
34924 things 1
18867 keep 1
6955 conflict 1
11285 enough 1
8409 days 3
34891 these 2
1860 around 1
5992 cinema 1
31495 sinful 1
5537 change 1
28226 refreshing 1
17606 innocence 1
36302 unbridled 1
38261 while 1
12420 fault 1
23116 nearly 1
5623 charms 1
13641 frothy 1
20023 light 1
38972 yet 1
28927 retro 1
25932 playacting 1
15012 grungers 1
1629 appear 1
10579 early 1
34583 teens 1
7310 convince 1
35929 truly 1
23058 natural 1
11298 ensemble 1
39019 young 1
10195 dramatic 1
3291 best 1
3382 biggest 1
8763 delivering 1
28469 remarkable 1
20378 lookalike 1
23594 notably 1
5256 cast 1
11352 entire 1
38688 work 2
20044 likable 1
5620 charming 1
10894 eliciting 1
539 actors 1
38156 well 1
38707 works 1
33945 surprise 1
23455 no 2
6568 come 1
31216 should 1
38803 write 1
16756 i 2
22009 mind 1
25946 playing 1
33147 still 1
29400 rolled 1
15579 have 1
7763 credits 1
11155 end 2
812 after 1
20355 long 2
15627 head 1
39026 your 1
33013 stay 1
15029 guaranteed 1
30199 schlesinger 1
561 adam 1
4780 by 1
8129 cut 1
35246 title 1
17438 infectious 1
36013 tunes 1
13413 four 1
38812 writing 1
15324 hand 1
15207 had 1
16033 himself 1
38814 written 1
12043 expressly 1
37951 was 1
15681 heart 1
22897 my 2
14669 grace 1
27992 recent 1
24317 other 1
20045 like 1
22848 music 2
1134 also 1
4743 but 4
30822 settings 1
6268 clothes 1
25375 period 2
28205 reflected 1
23591 not 5
38933 year 1
19548 last 1
4903 calls 1
38257 which 3
32588 spirit 2
17607 innocent 2
28087 recreating 1
8680 deftly 1
9420 director 2
38805 writer 1
5038 capable 1
2912 be 2
27107 proves 1
36137 tyler 2
20210 liv 1
12447 faye 1
13861 galpal 1
23170 neglected 1
25420 perpetually 1
33654 success 2
35261 to 12
29131 ride 1
1119 along 1
18340 jazz 1
1999 aspirations 1
38327 who 2
10352 drummer 1
30345 scott 2
11698 everett 1
15160 guy 1
5438 center 1
12727 film 5
11024 embry 1
11619 ethan 1
25938 player 1
2827 bass 1
1951 as 5
24068 only 3
19184 known 1
36139 type 1
14039 geeky 1
14589 goofy 1
15094 guitarist 1
39076 zahn 1
33114 steve 1
19823 lenny 1
7732 crazy 1
14290 girl 1
30168 schaech 1
18528 johnathon 1
18470 jimmy 2
32268 songwriter 1
31502 singer 1
19665 lead 2
4407 brooding 1
34871 there 4
9819 diverse 1
23063 naturally 1
1772 are 1
21661 members 1
14970 group 2
7583 course 1
4893 called 1
16100 hit 1
8272 dance 1
20854 major 1
30327 score 1
34898 they 4
38242 when 1
17161 in 11
32684 spotlight 1
23047 national 1
17939 into 1
35041 thrust 1
33687 suddenly 1
25284 pennsylvania 1
11492 erie 1
13624 from 4
2632 band 1
29349 rock 1
34578 teen 1
38637 wonders 3
13159 focuses 1
21991 milquetoast 1
3561 bland 2
3007 becoming 1
24048 on 3
34589 teeters 1
34093 sweet 1
35810 trifle 1
23583 nostalgia 2
34943 this 3
13246 for 5
16041 hindrance 1
224 a 12
3006 becomes 2
16477 however 1
27415 quality 1
19570 latter 1
18136 is 15
18183 it 10
23331 nice 4
32122 so 6
23981 oh 1
20217 lively 1
13710 fun 1
22354 moment 2
23933 of 13
538 actor 1
30395 screen 1
3177 beloved 1
22569 most 2
38559 with 2
2068 associate 1
38748 would 1
27414 qualities 1
34827 the 38
1057 all 4
15516 has 2
8483 debut 1
9423 directorial 1
1365 and 12
30409 screenwriting 1
29744 s 16
15375 hanks 7
35317 tom 2
27527 r 1
9869 do 9
39018 you 8
34918 thing 10
34823 that 17
